packages/fxa-auth-server/test/local/payments/fixtures/plan2.json

{
  "id": "plan_G93mMKnIFCjZek",
  "object": "plan",
  "active": true,
  "aggregate_usage": null,
  "amount": 999,
  "amount_decimal": "999",
  "billing_scheme": "per_unit",
  "created": 1573274099,
  "currency": "usd",
  "interval": "month",
  "interval_count": 1,
  "livemode": false,
  "metadata": {},
  "nickname": "FPN Advanced",
  "product": {
    "id": "prod_G93mdk6bGPJ7wy",
    "object": "product",
    "active": true,
    "attributes": [],
    "caption": null,
    "created": 1573274089,
    "deactivate_on": [],
    "description": null,
    "images": [],
    "livemode": false,
    "metadata": {
      "productSet": "fpn_product",
      "productOrder": "2"
    },
    "name": "FPN Tier 2",
    "package_dimensions": null,
    "shippable": null,
    "statement_descriptor": null,
    "type": "service",
    "unit_label": null,
    "updated": 1573837071,
    "url": null
  },
  "tiers": null,
  "tiers_mode": null,
  "transform_usage": null,
  "trial_period_days": null,
  "usage_type": "licensed"
}
